#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/give-back-cincinnati/gbc-infra/runs/run-sQuCLN9dmtrwHi13

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zones.gbc: Reading...
data.cloudflare_zones.gbc: Read complete after 1s [id=86d947abd1990f315eb415450516882e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_resource_group.aks_resource_group will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "aks_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = (known after apply)
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "gbcCR"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "gbc-resources"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.gbc will be created
  + resource "azurerm_kubernetes_cluster" "gbc" {
      + dns_prefix              = "gbc-dns"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubernetes_version      = (known after apply)
      + location                = "eastus"
      + name                    = "gbc-aks"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = (known after apply)
      + private_dns_zone_id     = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "gbc-resources"
      + sku_tier                = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling  = true
          + max_count            = 2
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + type                 = "VirtualMachineScaleSets"
          + vm_size              = "Standard_D2_v2"
          + vnet_subnet_id       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + azure_rbac_enabled     = (known after apply)
              + client_app_id          = (known after apply)
              + managed                = (known after apply)
              + server_app_id          = (known after apply)
              + server_app_secret      = (sensitive value)
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # azurerm_public_ip.gbc will be created
  + resource "azurerm_public_ip" "gbc" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = (known after apply)
      + name                    = "gbcPublicIp"
      + resource_group_name     = (known after apply)
      + sku                     = "Standard"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.gbc will be created
  + resource "azurerm_resource_group" "gbc" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "gbc-resources"
    }

  # azurerm_subnet.gbc_subnet will be created
  + resource "azurerm_subnet" "gbc_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.1.0.0/22",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "gbc-subnet"
      + resource_group_name                            = "gbc-resources"
      + service_endpoints                              = [
          + "Microsoft.Sql",
        ]
      + virtual_network_name                           = "gbc-vnet"
    }

  # azurerm_virtual_network.gbc_vnet will be created
  + resource "azurerm_virtual_network" "gbc_vnet" {
      + address_space         = [
          + "10.1.0.0/16",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "eastus"
      + name                  = "gbc-vnet"
      + resource_group_name   = "gbc-resources"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

  # cloudflare_page_rule.www_redirect will be created
  + resource "cloudflare_page_rule" "www_redirect" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "www.givebackcincinnati.org"
      + zone_id  = "f746dcf37d3a9a454301a1744e99af3b"

      + actions {
          + always_use_https    = false
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false

          + forwarding_url {
              + status_code = 301
              + url         = "https://givebackcincinnati.org"
            }
        }
    }

  # cloudflare_record.gbc_api will be created
  + resource "cloudflare_record" "gbc_api" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "api.givebackcincinnati.org"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "f746dcf37d3a9a454301a1744e99af3b"
    }

  # cloudflare_record.gbc_app will be created
  + resource "cloudflare_record" "gbc_app" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "app.givebackcincinnati.org"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "gbc.pages.dev"
      + zone_id     = "f746dcf37d3a9a454301a1744e99af3b"
    }

  # cloudflare_record.gbc_next will be created
  + resource "cloudflare_record" "gbc_next" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "next.givebackcincinnati.org"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "CNAME"
      + value       = "gbc.pages.dev"
      + zone_id     = "f746dcf37d3a9a454301a1744e99af3b"
    }

  # cloudflare_record.vault will be created
  + resource "cloudflare_record" "vault" {
      + created_on  = (known after apply)
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "vault.givebackcincinnati.org"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = 1
      + type        = "A"
      + value       = (known after apply)
      + zone_id     = "f746dcf37d3a9a454301a1744e99af3b"
    }

  # cloudflare_zone_settings_override.gbc_dev_settings will be created
  + resource "cloudflare_zone_settings_override" "gbc_dev_settings" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "f746dcf37d3a9a454301a1744e99af3b"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = (known after apply)
          + brotli                      = "on"
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = (known after apply)
          + challenge_ttl               = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + email_obfuscation           = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + http3                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = (known after apply)
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "strict"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = "on"
          + zero_rtt                    = (known after apply)

          + minify {
              + css  = "on"
              + html = "on"
              + js   = "on"
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = (known after apply)
              + include_subdomains = (known after apply)
              + max_age            = (known after apply)
              + nosniff            = (known after apply)
              + preload            = (known after apply)
            }
        }
    }

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gbc"
      + namespace                  = "cert-manager"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.9.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + atomic                     = false
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gbc"
      + namespace                  = "ingress-nginx"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.2.27"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "replicaCount"
          + value = "3"
        }
      + set {
          + name  = "service.loadBalancerIP"
          + value = (known after apply)
        }
      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

  # helm_release.vault will be created
  + resource "helm_release" "vault" {
      + atomic                     = false
      + chart                      = "vault"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gbc"
      + namespace                  = "vault"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.releases.hashicorp.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.20.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "ui.enabled"
          + value = "true"
        }
    }

  # kubernetes_namespace.cert_manager will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.ingress will be created
  + resource "kubernetes_namespace" "ingress" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.new_relic will be created
  + resource "kubernetes_namespace" "new_relic" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "new-relic"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.prod will be created
  + resource "kubernetes_namespace" "prod" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.stage will be created
  + resource "kubernetes_namespace" "stage" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "stage"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.vault will be created
  + resource "kubernetes_namespace" "vault" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 21 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_certificate = (sensitive value)
  + kube_config        = (sensitive value)

```
</details>
*Pushed by: @MYoung25, Action: `pull_request`*